docs/perf/raw/order-checkout-prepare-loadtest-guest-2026-03-31.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: scripts/loadtest/order-checkout-no-confirm.k6.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 3m30s max duration (incl. graceful stop):
              * checkout_prepare_load: 200.00 iterations/s for 3m0s (maxVUs: 100, gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 5 complete and 0 interrupted iterations
checkout_prepare_load   [   1% ] 100/100 VUs  0m01.0s/3m0s  200.00 iters/s

running (0m02.0s), 100/100 VUs, 9 complete and 0 interrupted iterations
checkout_prepare_load   [   1% ] 100/100 VUs  0m02.0s/3m0s  200.00 iters/s

running (0m03.0s), 100/100 VUs, 35 complete and 0 interrupted iterations
checkout_prepare_load   [   2% ] 100/100 VUs  0m03.0s/3m0s  200.00 iters/s

running (0m04.0s), 100/100 VUs, 60 complete and 0 interrupted iterations
checkout_prepare_load   [   2% ] 100/100 VUs  0m04.0s/3m0s  200.00 iters/s

running (0m05.0s), 100/100 VUs, 91 complete and 0 interrupted iterations
checkout_prepare_load   [   3% ] 100/100 VUs  0m05.0s/3m0s  200.00 iters/s

running (0m06.0s), 100/100 VUs, 112 complete and 0 interrupted iterations
checkout_prepare_load   [   3% ] 100/100 VUs  0m06.0s/3m0s  200.00 iters/s

running (0m07.0s), 100/100 VUs, 138 complete and 0 interrupted iterations
checkout_prepare_load   [   4% ] 100/100 VUs  0m07.0s/3m0s  200.00 iters/s

running (0m08.0s), 100/100 VUs, 157 complete and 0 interrupted iterations
checkout_prepare_load   [   4% ] 100/100 VUs  0m08.0s/3m0s  200.00 iters/s

running (0m09.0s), 100/100 VUs, 179 complete and 0 interrupted iterations
checkout_prepare_load   [   5% ] 100/100 VUs  0m09.0s/3m0s  200.00 iters/s

running (0m10.0s), 100/100 VUs, 203 complete and 0 interrupted iterations
checkout_prepare_load   [   6% ] 100/100 VUs  0m10.0s/3m0s  200.00 iters/s

running (0m11.0s), 100/100 VUs, 227 complete and 0 interrupted iterations
checkout_prepare_load   [   6% ] 100/100 VUs  0m11.0s/3m0s  200.00 iters/s

running (0m12.0s), 100/100 VUs, 248 complete and 0 interrupted iterations
checkout_prepare_load   [   7% ] 100/100 VUs  0m12.0s/3m0s  200.00 iters/s

running (0m13.0s), 100/100 VUs, 277 complete and 0 interrupted iterations
checkout_prepare_load   [   7% ] 100/100 VUs  0m13.0s/3m0s  200.00 iters/s

running (0m14.0s), 100/100 VUs, 303 complete and 0 interrupted iterations
checkout_prepare_load   [   8% ] 100/100 VUs  0m14.0s/3m0s  200.00 iters/s

running (0m15.0s), 098/100 VUs, 335 complete and 0 interrupted iterations
checkout_prepare_load   [   8% ] 098/100 VUs  0m15.0s/3m0s  200.00 iters/s

running (0m16.0s), 099/100 VUs, 363 complete and 0 interrupted iterations
checkout_prepare_load   [   9% ] 099/100 VUs  0m16.0s/3m0s  200.00 iters/s

running (0m17.0s), 100/100 VUs, 389 complete and 0 interrupted iterations
checkout_prepare_load   [   9% ] 100/100 VUs  0m17.0s/3m0s  200.00 iters/s

running (0m18.0s), 100/100 VUs, 413 complete and 0 interrupted iterations
checkout_prepare_load   [  10% ] 100/100 VUs  0m18.0s/3m0s  200.00 iters/s

running (0m19.0s), 100/100 VUs, 431 complete and 0 interrupted iterations
checkout_prepare_load   [  11% ] 100/100 VUs  0m19.0s/3m0s  200.00 iters/s

running (0m20.0s), 100/100 VUs, 453 complete and 0 interrupted iterations
checkout_prepare_load   [  11% ] 100/100 VUs  0m20.0s/3m0s  200.00 iters/s

running (0m21.0s), 100/100 VUs, 475 complete and 0 interrupted iterations
checkout_prepare_load   [  12% ] 100/100 VUs  0m21.0s/3m0s  200.00 iters/s

running (0m22.0s), 100/100 VUs, 496 complete and 0 interrupted iterations
checkout_prepare_load   [  12% ] 100/100 VUs  0m22.0s/3m0s  200.00 iters/s

running (0m23.0s), 100/100 VUs, 512 complete and 0 interrupted iterations
checkout_prepare_load   [  13% ] 100/100 VUs  0m23.0s/3m0s  200.00 iters/s

running (0m24.0s), 100/100 VUs, 539 complete and 0 interrupted iterations
checkout_prepare_load   [  13% ] 100/100 VUs  0m24.0s/3m0s  200.00 iters/s

running (0m25.0s), 100/100 VUs, 564 complete and 0 interrupted iterations
checkout_prepare_load   [  14% ] 100/100 VUs  0m25.0s/3m0s  200.00 iters/s

running (0m26.0s), 100/100 VUs, 590 complete and 0 interrupted iterations
checkout_prepare_load   [  14% ] 100/100 VUs  0m26.0s/3m0s  200.00 iters/s

running (0m27.0s), 100/100 VUs, 619 complete and 0 interrupted iterations
checkout_prepare_load   [  15% ] 100/100 VUs  0m27.0s/3m0s  200.00 iters/s

running (0m28.0s), 100/100 VUs, 645 complete and 0 interrupted iterations
checkout_prepare_load   [  16% ] 100/100 VUs  0m28.0s/3m0s  200.00 iters/s

running (0m29.0s), 100/100 VUs, 668 complete and 0 interrupted iterations
checkout_prepare_load   [  16% ] 100/100 VUs  0m29.0s/3m0s  200.00 iters/s

running (0m30.0s), 100/100 VUs, 698 complete and 0 interrupted iterations
checkout_prepare_load   [  17% ] 100/100 VUs  0m30.0s/3m0s  200.00 iters/s

running (0m31.0s), 100/100 VUs, 725 complete and 0 interrupted iterations
checkout_prepare_load   [  17% ] 100/100 VUs  0m31.0s/3m0s  200.00 iters/s

running (0m32.0s), 100/100 VUs, 755 complete and 0 interrupted iterations
checkout_prepare_load   [  18% ] 100/100 VUs  0m32.0s/3m0s  200.00 iters/s

running (0m33.0s), 100/100 VUs, 784 complete and 0 interrupted iterations
checkout_prepare_load   [  18% ] 100/100 VUs  0m33.0s/3m0s  200.00 iters/s

running (0m34.0s), 100/100 VUs, 804 complete and 0 interrupted iterations
checkout_prepare_load   [  19% ] 100/100 VUs  0m34.0s/3m0s  200.00 iters/s

running (0m35.0s), 100/100 VUs, 833 complete and 0 interrupted iterations
checkout_prepare_load   [  19% ] 100/100 VUs  0m35.0s/3m0s  200.00 iters/s

running (0m36.0s), 100/100 VUs, 863 complete and 0 interrupted iterations
checkout_prepare_load   [  20% ] 100/100 VUs  0m36.0s/3m0s  200.00 iters/s

running (0m37.0s), 100/100 VUs, 886 complete and 0 interrupted iterations
checkout_prepare_load   [  21% ] 100/100 VUs  0m37.0s/3m0s  200.00 iters/s

running (0m38.0s), 100/100 VUs, 909 complete and 0 interrupted iterations
checkout_prepare_load   [  21% ] 100/100 VUs  0m38.0s/3m0s  200.00 iters/s

running (0m39.0s), 100/100 VUs, 927 complete and 0 interrupted iterations
checkout_prepare_load   [  22% ] 100/100 VUs  0m39.0s/3m0s  200.00 iters/s

running (0m40.0s), 100/100 VUs, 949 complete and 0 interrupted iterations
checkout_prepare_load   [  22% ] 100/100 VUs  0m40.0s/3m0s  200.00 iters/s

running (0m41.0s), 100/100 VUs, 978 complete and 0 interrupted iterations
checkout_prepare_load   [  23% ] 100/100 VUs  0m41.0s/3m0s  200.00 iters/s

running (0m42.0s), 100/100 VUs, 998 complete and 0 interrupted iterations
checkout_prepare_load   [  23% ] 100/100 VUs  0m42.0s/3m0s  200.00 iters/s

running (0m43.0s), 100/100 VUs, 1023 complete and 0 interrupted iterations
checkout_prepare_load   [  24% ] 100/100 VUs  0m43.0s/3m0s  200.00 iters/s

running (0m44.0s), 100/100 VUs, 1047 complete and 0 interrupted iterations
checkout_prepare_load   [  24% ] 100/100 VUs  0m44.0s/3m0s  200.00 iters/s

running (0m45.0s), 100/100 VUs, 1071 complete and 0 interrupted iterations
checkout_prepare_load   [  25% ] 100/100 VUs  0m45.0s/3m0s  200.00 iters/s

running (0m46.0s), 100/100 VUs, 1092 complete and 0 interrupted iterations
checkout_prepare_load   [  26% ] 100/100 VUs  0m46.0s/3m0s  200.00 iters/s

running (0m47.0s), 100/100 VUs, 1109 complete and 0 interrupted iterations
checkout_prepare_load   [  26% ] 100/100 VUs  0m47.0s/3m0s  200.00 iters/s

running (0m48.0s), 100/100 VUs, 1133 complete and 0 interrupted iterations
checkout_prepare_load   [  27% ] 100/100 VUs  0m48.0s/3m0s  200.00 iters/s

running (0m49.0s), 100/100 VUs, 1154 complete and 0 interrupted iterations
checkout_prepare_load   [  27% ] 100/100 VUs  0m49.0s/3m0s  200.00 iters/s

running (0m50.0s), 100/100 VUs, 1174 complete and 0 interrupted iterations
checkout_prepare_load   [  28% ] 100/100 VUs  0m50.0s/3m0s  200.00 iters/s

running (0m51.0s), 100/100 VUs, 1179 complete and 0 interrupted iterations
checkout_prepare_load   [  28% ] 100/100 VUs  0m51.0s/3m0s  200.00 iters/s

running (0m52.0s), 100/100 VUs, 1197 complete and 0 interrupted iterations
checkout_prepare_load   [  29% ] 100/100 VUs  0m52.0s/3m0s  200.00 iters/s

running (0m53.0s), 100/100 VUs, 1208 complete and 0 interrupted iterations
checkout_prepare_load   [  29% ] 100/100 VUs  0m53.0s/3m0s  200.00 iters/s

running (0m54.0s), 100/100 VUs, 1209 complete and 0 interrupted iterations
checkout_prepare_load   [  30% ] 100/100 VUs  0m54.0s/3m0s  200.00 iters/s

running (0m55.2s), 100/100 VUs, 1218 complete and 0 interrupted iterations
checkout_prepare_load   [  31% ] 100/100 VUs  0m55.3s/3m0s  200.00 iters/s

running (0m56.0s), 100/100 VUs, 1224 complete and 0 interrupted iterations
checkout_prepare_load   [  31% ] 100/100 VUs  0m56.0s/3m0s  200.00 iters/s

running (0m57.0s), 100/100 VUs, 1228 complete and 0 interrupted iterations
checkout_prepare_load   [  32% ] 100/100 VUs  0m57.0s/3m0s  200.00 iters/s

running (0m58.0s), 100/100 VUs, 1233 complete and 0 interrupted iterations
checkout_prepare_load   [  32% ] 100/100 VUs  0m58.0s/3m0s  200.00 iters/s

running (0m59.0s), 100/100 VUs, 1242 complete and 0 interrupted iterations
checkout_prepare_load   [  33% ] 100/100 VUs  0m59.0s/3m0s  200.00 iters/s

running (1m00.0s), 100/100 VUs, 1244 complete and 0 interrupted iterations
checkout_prepare_load   [  33% ] 100/100 VUs  1m00.0s/3m0s  200.00 iters/s

running (1m01.0s), 100/100 VUs, 1249 complete and 0 interrupted iterations
checkout_prepare_load   [  34% ] 100/100 VUs  1m01.0s/3m0s  200.00 iters/s

running (1m02.0s), 100/100 VUs, 1249 complete and 0 interrupted iterations
checkout_prepare_load   [  34% ] 100/100 VUs  1m02.0s/3m0s  200.00 iters/s

running (1m03.0s), 100/100 VUs, 1259 complete and 0 interrupted iterations
checkout_prepare_load   [  35% ] 100/100 VUs  1m03.0s/3m0s  200.00 iters/s

running (1m04.0s), 100/100 VUs, 1265 complete and 0 interrupted iterations
checkout_prepare_load   [  36% ] 100/100 VUs  1m04.0s/3m0s  200.00 iters/s

running (1m05.0s), 100/100 VUs, 1269 complete and 0 interrupted iterations
checkout_prepare_load   [  36% ] 100/100 VUs  1m05.0s/3m0s  200.00 iters/s

running (1m06.0s), 100/100 VUs, 1269 complete and 0 interrupted iterations
checkout_prepare_load   [  37% ] 100/100 VUs  1m06.0s/3m0s  200.00 iters/s

running (1m07.0s), 100/100 VUs, 1269 complete and 0 interrupted iterations
checkout_prepare_load   [  37% ] 100/100 VUs  1m07.0s/3m0s  200.00 iters/s

running (1m08.0s), 100/100 VUs, 1269 complete and 0 interrupted iterations
checkout_prepare_load   [  38% ] 100/100 VUs  1m08.0s/3m0s  200.00 iters/s

running (1m09.0s), 100/100 VUs, 1269 complete and 0 interrupted iterations
checkout_prepare_load   [  38% ] 100/100 VUs  1m09.0s/3m0s  200.00 iters/s

running (1m10.0s), 100/100 VUs, 1269 complete and 0 interrupted iterations
checkout_prepare_load   [  39% ] 100/100 VUs  1m10.0s/3m0s  200.00 iters/s

running (1m11.0s), 100/100 VUs, 1274 complete and 0 interrupted iterations
checkout_prepare_load   [  39% ] 100/100 VUs  1m11.0s/3m0s  200.00 iters/s

running (1m12.0s), 100/100 VUs, 1274 complete and 0 interrupted iterations
checkout_prepare_load   [  40% ] 100/100 VUs  1m12.0s/3m0s  200.00 iters/s

running (1m13.0s), 100/100 VUs, 1274 complete and 0 interrupted iterations
checkout_prepare_load   [  41% ] 100/100 VUs  1m13.0s/3m0s  200.00 iters/s

running (1m14.0s), 100/100 VUs, 1274 complete and 0 interrupted iterations
checkout_prepare_load   [  41% ] 100/100 VUs  1m14.0s/3m0s  200.00 iters/s

running (1m15.0s), 100/100 VUs, 1274 complete and 0 interrupted iterations
checkout_prepare_load   [  42% ] 100/100 VUs  1m15.0s/3m0s  200.00 iters/s

running (1m16.0s), 100/100 VUs, 1279 complete and 0 interrupted iterations
checkout_prepare_load   [  42% ] 100/100 VUs  1m16.0s/3m0s  200.00 iters/s

running (1m17.0s), 100/100 VUs, 1286 complete and 0 interrupted iterations
checkout_prepare_load   [  43% ] 100/100 VUs  1m17.0s/3m0s  200.00 iters/s

running (1m18.0s), 100/100 VUs, 1302 complete and 0 interrupted iterations
checkout_prepare_load   [  43% ] 100/100 VUs  1m18.0s/3m0s  200.00 iters/s

running (1m19.0s), 100/100 VUs, 1309 complete and 0 interrupted iterations
checkout_prepare_load   [  44% ] 100/100 VUs  1m19.0s/3m0s  200.00 iters/s

running (1m20.0s), 100/100 VUs, 1315 complete and 0 interrupted iterations
checkout_prepare_load   [  44% ] 100/100 VUs  1m20.0s/3m0s  200.00 iters/s

running (1m21.0s), 100/100 VUs, 1329 complete and 0 interrupted iterations
checkout_prepare_load   [  45% ] 100/100 VUs  1m21.0s/3m0s  200.00 iters/s

running (1m22.0s), 099/100 VUs, 1346 complete and 0 interrupted iterations
checkout_prepare_load   [  46% ] 099/100 VUs  1m22.0s/3m0s  200.00 iters/s

running (1m23.0s), 100/100 VUs, 1346 complete and 0 interrupted iterations
checkout_prepare_load   [  46% ] 100/100 VUs  1m23.0s/3m0s  200.00 iters/s

running (1m24.0s), 100/100 VUs, 1350 complete and 0 interrupted iterations
checkout_prepare_load   [  47% ] 100/100 VUs  1m24.0s/3m0s  200.00 iters/s

running (1m25.0s), 100/100 VUs, 1350 complete and 0 interrupted iterations
checkout_prepare_load   [  47% ] 100/100 VUs  1m25.0s/3m0s  200.00 iters/s

running (1m26.0s), 100/100 VUs, 1355 complete and 0 interrupted iterations
checkout_prepare_load   [  48% ] 100/100 VUs  1m26.0s/3m0s  200.00 iters/s

running (1m27.0s), 100/100 VUs, 1360 complete and 0 interrupted iterations
checkout_prepare_load   [  48% ] 100/100 VUs  1m27.0s/3m0s  200.00 iters/s

running (1m28.0s), 100/100 VUs, 1366 complete and 0 interrupted iterations
checkout_prepare_load   [  49% ] 100/100 VUs  1m28.0s/3m0s  200.00 iters/s

running (1m29.0s), 100/100 VUs, 1366 complete and 0 interrupted iterations
checkout_prepare_load   [  49% ] 100/100 VUs  1m29.0s/3m0s  200.00 iters/s

running (1m30.0s), 100/100 VUs, 1366 complete and 0 interrupted iterations
checkout_prepare_load   [  50% ] 100/100 VUs  1m30.0s/3m0s  200.00 iters/s

running (1m31.0s), 100/100 VUs, 1366 complete and 0 interrupted iterations
checkout_prepare_load   [  51% ] 100/100 VUs  1m31.0s/3m0s  200.00 iters/s

running (1m32.0s), 100/100 VUs, 1366 complete and 0 interrupted iterations
checkout_prepare_load   [  51% ] 100/100 VUs  1m32.0s/3m0s  200.00 iters/s

running (1m33.0s), 100/100 VUs, 1366 complete and 0 interrupted iterations
checkout_prepare_load   [  52% ] 100/100 VUs  1m33.0s/3m0s  200.00 iters/s

running (1m34.0s), 100/100 VUs, 1366 complete and 0 interrupted iterations
checkout_prepare_load   [  52% ] 100/100 VUs  1m34.0s/3m0s  200.00 iters/s

running (1m35.0s), 100/100 VUs, 1369 complete and 0 interrupted iterations
checkout_prepare_load   [  53% ] 100/100 VUs  1m35.0s/3m0s  200.00 iters/s

running (1m36.0s), 100/100 VUs, 1369 complete and 0 interrupted iterations
checkout_prepare_load   [  53% ] 100/100 VUs  1m36.0s/3m0s  200.00 iters/s

running (1m37.0s), 100/100 VUs, 1369 complete and 0 interrupted iterations
checkout_prepare_load   [  54% ] 100/100 VUs  1m37.0s/3m0s  200.00 iters/s

running (1m38.0s), 100/100 VUs, 1369 complete and 0 interrupted iterations
checkout_prepare_load   [  54% ] 100/100 VUs  1m38.0s/3m0s  200.00 iters/s

running (1m39.0s), 100/100 VUs, 1369 complete and 0 interrupted iterations
checkout_prepare_load   [  55% ] 100/100 VUs  1m39.0s/3m0s  200.00 iters/s

running (1m40.0s), 100/100 VUs, 1369 complete and 0 interrupted iterations
checkout_prepare_load   [  56% ] 100/100 VUs  1m40.0s/3m0s  200.00 iters/s

running (1m41.0s), 100/100 VUs, 1374 complete and 0 interrupted iterations
checkout_prepare_load   [  56% ] 100/100 VUs  1m41.0s/3m0s  200.00 iters/s

running (1m42.0s), 100/100 VUs, 1374 complete and 0 interrupted iterations
checkout_prepare_load   [  57% ] 100/100 VUs  1m42.0s/3m0s  200.00 iters/s

running (1m43.0s), 100/100 VUs, 1374 complete and 0 interrupted iterations
checkout_prepare_load   [  57% ] 100/100 VUs  1m43.0s/3m0s  200.00 iters/s

running (1m44.0s), 100/100 VUs, 1374 complete and 0 interrupted iterations
checkout_prepare_load   [  58% ] 100/100 VUs  1m44.0s/3m0s  200.00 iters/s

running (1m45.0s), 100/100 VUs, 1374 complete and 0 interrupted iterations
checkout_prepare_load   [  58% ] 100/100 VUs  1m45.0s/3m0s  200.00 iters/s

running (1m46.0s), 100/100 VUs, 1379 complete and 0 interrupted iterations
checkout_prepare_load   [  59% ] 100/100 VUs  1m46.0s/3m0s  200.00 iters/s

running (1m47.0s), 100/100 VUs, 1386 complete and 0 interrupted iterations
checkout_prepare_load   [  59% ] 100/100 VUs  1m47.0s/3m0s  200.00 iters/s

running (1m48.0s), 100/100 VUs, 1402 complete and 0 interrupted iterations
checkout_prepare_load   [  60% ] 100/100 VUs  1m48.0s/3m0s  200.00 iters/s

running (1m49.0s), 100/100 VUs, 1408 complete and 0 interrupted iterations
checkout_prepare_load   [  61% ] 100/100 VUs  1m49.0s/3m0s  200.00 iters/s

running (1m50.0s), 100/100 VUs, 1415 complete and 0 interrupted iterations
checkout_prepare_load   [  61% ] 100/100 VUs  1m50.0s/3m0s  200.00 iters/s

running (1m51.0s), 100/100 VUs, 1429 complete and 0 interrupted iterations
checkout_prepare_load   [  62% ] 100/100 VUs  1m51.0s/3m0s  200.00 iters/s

running (1m52.0s), 098/100 VUs, 1445 complete and 0 interrupted iterations
checkout_prepare_load   [  62% ] 098/100 VUs  1m52.0s/3m0s  200.00 iters/s

running (1m53.0s), 100/100 VUs, 1446 complete and 0 interrupted iterations
checkout_prepare_load   [  63% ] 100/100 VUs  1m53.0s/3m0s  200.00 iters/s

running (1m54.0s), 100/100 VUs, 1450 complete and 0 interrupted iterations
checkout_prepare_load   [  63% ] 100/100 VUs  1m54.0s/3m0s  200.00 iters/s

running (1m55.0s), 100/100 VUs, 1450 complete and 0 interrupted iterations
checkout_prepare_load   [  64% ] 100/100 VUs  1m55.0s/3m0s  200.00 iters/s

running (1m56.0s), 100/100 VUs, 1455 complete and 0 interrupted iterations
checkout_prepare_load   [  64% ] 100/100 VUs  1m56.0s/3m0s  200.00 iters/s

running (1m57.0s), 100/100 VUs, 1460 complete and 0 interrupted iterations
checkout_prepare_load   [  65% ] 100/100 VUs  1m57.0s/3m0s  200.00 iters/s

running (1m58.0s), 100/100 VUs, 1465 complete and 0 interrupted iterations
checkout_prepare_load   [  66% ] 100/100 VUs  1m58.0s/3m0s  200.00 iters/s

running (1m59.0s), 100/100 VUs, 1466 complete and 0 interrupted iterations
checkout_prepare_load   [  66% ] 100/100 VUs  1m59.0s/3m0s  200.00 iters/s

running (2m00.0s), 100/100 VUs, 1466 complete and 0 interrupted iterations
checkout_prepare_load   [  67% ] 100/100 VUs  2m00.0s/3m0s  200.00 iters/s

running (2m01.0s), 100/100 VUs, 1466 complete and 0 interrupted iterations
checkout_prepare_load   [  67% ] 100/100 VUs  2m01.0s/3m0s  200.00 iters/s

running (2m02.0s), 100/100 VUs, 1466 complete and 0 interrupted iterations
checkout_prepare_load   [  68% ] 100/100 VUs  2m02.0s/3m0s  200.00 iters/s

running (2m03.0s), 100/100 VUs, 1466 complete and 0 interrupted iterations
checkout_prepare_load   [  68% ] 100/100 VUs  2m03.0s/3m0s  200.00 iters/s

running (2m04.0s), 100/100 VUs, 1466 complete and 0 interrupted iterations
checkout_prepare_load   [  69% ] 100/100 VUs  2m04.0s/3m0s  200.00 iters/s

running (2m05.0s), 100/100 VUs, 1469 complete and 0 interrupted iterations
checkout_prepare_load   [  69% ] 100/100 VUs  2m05.0s/3m0s  200.00 iters/s

running (2m06.0s), 100/100 VUs, 1469 complete and 0 interrupted iterations
checkout_prepare_load   [  70% ] 100/100 VUs  2m06.0s/3m0s  200.00 iters/s

running (2m07.0s), 100/100 VUs, 1469 complete and 0 interrupted iterations
checkout_prepare_load   [  71% ] 100/100 VUs  2m07.0s/3m0s  200.00 iters/s

running (2m08.0s), 100/100 VUs, 1469 complete and 0 interrupted iterations
checkout_prepare_load   [  71% ] 100/100 VUs  2m08.0s/3m0s  200.00 iters/s

running (2m09.0s), 100/100 VUs, 1469 complete and 0 interrupted iterations
checkout_prepare_load   [  72% ] 100/100 VUs  2m09.0s/3m0s  200.00 iters/s

running (2m10.0s), 100/100 VUs, 1469 complete and 0 interrupted iterations
checkout_prepare_load   [  72% ] 100/100 VUs  2m10.0s/3m0s  200.00 iters/s

running (2m11.0s), 100/100 VUs, 1474 complete and 0 interrupted iterations
checkout_prepare_load   [  73% ] 100/100 VUs  2m11.0s/3m0s  200.00 iters/s

running (2m12.0s), 100/100 VUs, 1474 complete and 0 interrupted iterations
checkout_prepare_load   [  73% ] 100/100 VUs  2m12.0s/3m0s  200.00 iters/s

running (2m13.0s), 100/100 VUs, 1474 complete and 0 interrupted iterations
checkout_prepare_load   [  74% ] 100/100 VUs  2m13.0s/3m0s  200.00 iters/s

running (2m14.0s), 100/100 VUs, 1474 complete and 0 interrupted iterations
checkout_prepare_load   [  74% ] 100/100 VUs  2m14.0s/3m0s  200.00 iters/s

running (2m15.0s), 100/100 VUs, 1474 complete and 0 interrupted iterations
checkout_prepare_load   [  75% ] 100/100 VUs  2m15.0s/3m0s  200.00 iters/s

running (2m16.0s), 100/100 VUs, 1479 complete and 0 interrupted iterations
checkout_prepare_load   [  76% ] 100/100 VUs  2m16.0s/3m0s  200.00 iters/s

running (2m17.0s), 100/100 VUs, 1486 complete and 0 interrupted iterations
checkout_prepare_load   [  76% ] 100/100 VUs  2m17.0s/3m0s  200.00 iters/s

running (2m18.0s), 100/100 VUs, 1502 complete and 0 interrupted iterations
checkout_prepare_load   [  77% ] 100/100 VUs  2m18.0s/3m0s  200.00 iters/s

running (2m19.0s), 100/100 VUs, 1508 complete and 0 interrupted iterations
checkout_prepare_load   [  77% ] 100/100 VUs  2m19.0s/3m0s  200.00 iters/s

running (2m20.0s), 100/100 VUs, 1515 complete and 0 interrupted iterations
checkout_prepare_load   [  78% ] 100/100 VUs  2m20.0s/3m0s  200.00 iters/s

running (2m21.0s), 100/100 VUs, 1529 complete and 0 interrupted iterations
checkout_prepare_load   [  78% ] 100/100 VUs  2m21.0s/3m0s  200.00 iters/s

running (2m22.0s), 099/100 VUs, 1543 complete and 0 interrupted iterations
checkout_prepare_load   [  79% ] 099/100 VUs  2m22.0s/3m0s  200.00 iters/s

running (2m23.0s), 100/100 VUs, 1546 complete and 0 interrupted iterations
checkout_prepare_load   [  79% ] 100/100 VUs  2m23.0s/3m0s  200.00 iters/s

running (2m24.0s), 100/100 VUs, 1550 complete and 0 interrupted iterations
checkout_prepare_load   [  80% ] 100/100 VUs  2m24.0s/3m0s  200.00 iters/s

running (2m25.0s), 100/100 VUs, 1550 complete and 0 interrupted iterations
checkout_prepare_load   [  81% ] 100/100 VUs  2m25.0s/3m0s  200.00 iters/s

running (2m26.0s), 100/100 VUs, 1555 complete and 0 interrupted iterations
checkout_prepare_load   [  81% ] 100/100 VUs  2m26.0s/3m0s  200.00 iters/s

running (2m27.0s), 100/100 VUs, 1560 complete and 0 interrupted iterations
checkout_prepare_load   [  82% ] 100/100 VUs  2m27.0s/3m0s  200.00 iters/s

running (2m28.0s), 100/100 VUs, 1564 complete and 0 interrupted iterations
checkout_prepare_load   [  82% ] 100/100 VUs  2m28.0s/3m0s  200.00 iters/s

running (2m29.0s), 100/100 VUs, 1566 complete and 0 interrupted iterations
checkout_prepare_load   [  83% ] 100/100 VUs  2m29.0s/3m0s  200.00 iters/s

running (2m30.0s), 100/100 VUs, 1566 complete and 0 interrupted iterations
checkout_prepare_load   [  83% ] 100/100 VUs  2m30.0s/3m0s  200.00 iters/s

running (2m31.0s), 100/100 VUs, 1566 complete and 0 interrupted iterations
checkout_prepare_load   [  84% ] 100/100 VUs  2m31.0s/3m0s  200.00 iters/s

running (2m32.0s), 100/100 VUs, 1566 complete and 0 interrupted iterations
checkout_prepare_load   [  84% ] 100/100 VUs  2m32.0s/3m0s  200.00 iters/s

running (2m33.0s), 100/100 VUs, 1566 complete and 0 interrupted iterations
checkout_prepare_load   [  85% ] 100/100 VUs  2m33.0s/3m0s  200.00 iters/s

running (2m34.0s), 100/100 VUs, 1566 complete and 0 interrupted iterations
checkout_prepare_load   [  86% ] 100/100 VUs  2m34.0s/3m0s  200.00 iters/s

running (2m35.0s), 100/100 VUs, 1569 complete and 0 interrupted iterations
checkout_prepare_load   [  86% ] 100/100 VUs  2m35.0s/3m0s  200.00 iters/s

running (2m36.0s), 100/100 VUs, 1569 complete and 0 interrupted iterations
checkout_prepare_load   [  87% ] 100/100 VUs  2m36.0s/3m0s  200.00 iters/s

running (2m37.0s), 100/100 VUs, 1569 complete and 0 interrupted iterations
checkout_prepare_load   [  87% ] 100/100 VUs  2m37.0s/3m0s  200.00 iters/s

running (2m38.0s), 100/100 VUs, 1569 complete and 0 interrupted iterations
checkout_prepare_load   [  88% ] 100/100 VUs  2m38.0s/3m0s  200.00 iters/s

running (2m39.0s), 100/100 VUs, 1569 complete and 0 interrupted iterations
checkout_prepare_load   [  88% ] 100/100 VUs  2m39.0s/3m0s  200.00 iters/s

running (2m40.0s), 100/100 VUs, 1569 complete and 0 interrupted iterations
checkout_prepare_load   [  89% ] 100/100 VUs  2m40.0s/3m0s  200.00 iters/s

running (2m41.0s), 100/100 VUs, 1574 complete and 0 interrupted iterations
checkout_prepare_load   [  89% ] 100/100 VUs  2m41.0s/3m0s  200.00 iters/s

running (2m42.0s), 100/100 VUs, 1574 complete and 0 interrupted iterations
checkout_prepare_load   [  90% ] 100/100 VUs  2m42.0s/3m0s  200.00 iters/s

running (2m43.0s), 100/100 VUs, 1574 complete and 0 interrupted iterations
checkout_prepare_load   [  91% ] 100/100 VUs  2m43.0s/3m0s  200.00 iters/s

running (2m44.0s), 100/100 VUs, 1574 complete and 0 interrupted iterations
checkout_prepare_load   [  91% ] 100/100 VUs  2m44.0s/3m0s  200.00 iters/s

running (2m45.0s), 100/100 VUs, 1574 complete and 0 interrupted iterations
checkout_prepare_load   [  92% ] 100/100 VUs  2m45.0s/3m0s  200.00 iters/s

running (2m46.0s), 100/100 VUs, 1579 complete and 0 interrupted iterations
checkout_prepare_load   [  92% ] 100/100 VUs  2m46.0s/3m0s  200.00 iters/s

running (2m47.0s), 100/100 VUs, 1586 complete and 0 interrupted iterations
checkout_prepare_load   [  93% ] 100/100 VUs  2m47.0s/3m0s  200.00 iters/s

running (2m48.0s), 100/100 VUs, 1602 complete and 0 interrupted iterations
checkout_prepare_load   [  93% ] 100/100 VUs  2m48.0s/3m0s  200.00 iters/s

running (2m49.0s), 100/100 VUs, 1608 complete and 0 interrupted iterations
checkout_prepare_load   [  94% ] 100/100 VUs  2m49.0s/3m0s  200.00 iters/s

running (2m50.0s), 100/100 VUs, 1615 complete and 0 interrupted iterations
checkout_prepare_load   [  94% ] 100/100 VUs  2m50.0s/3m0s  200.00 iters/s

running (2m51.0s), 100/100 VUs, 1629 complete and 0 interrupted iterations
checkout_prepare_load   [  95% ] 100/100 VUs  2m51.0s/3m0s  200.00 iters/s

running (2m52.0s), 100/100 VUs, 1642 complete and 0 interrupted iterations
checkout_prepare_load   [  96% ] 100/100 VUs  2m52.0s/3m0s  200.00 iters/s

running (2m53.0s), 100/100 VUs, 1646 complete and 0 interrupted iterations
checkout_prepare_load   [  96% ] 100/100 VUs  2m53.0s/3m0s  200.00 iters/s

running (2m54.0s), 100/100 VUs, 1650 complete and 0 interrupted iterations
checkout_prepare_load   [  97% ] 100/100 VUs  2m54.0s/3m0s  200.00 iters/s

running (2m55.0s), 100/100 VUs, 1650 complete and 0 interrupted iterations
checkout_prepare_load   [  97% ] 100/100 VUs  2m55.0s/3m0s  200.00 iters/s

running (2m56.0s), 100/100 VUs, 1655 complete and 0 interrupted iterations
checkout_prepare_load   [  98% ] 100/100 VUs  2m56.0s/3m0s  200.00 iters/s

running (2m57.0s), 100/100 VUs, 1660 complete and 0 interrupted iterations
checkout_prepare_load   [  98% ] 100/100 VUs  2m57.0s/3m0s  200.00 iters/s

running (2m58.0s), 099/100 VUs, 1664 complete and 0 interrupted iterations
checkout_prepare_load   [  99% ] 099/100 VUs  2m58.0s/3m0s  200.00 iters/s

running (2m59.0s), 100/100 VUs, 1666 complete and 0 interrupted iterations
checkout_prepare_load   [  99% ] 100/100 VUs  2m59.0s/3m0s  200.00 iters/s

running (3m00.0s), 100/100 VUs, 1666 complete and 0 interrupted iterations
checkout_prepare_load   [ 100% ] 100/100 VUs  3m00.0s/3m0s  200.00 iters/s

running (3m01.0s), 100/100 VUs, 1666 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m02.0s), 100/100 VUs, 1666 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m03.0s), 100/100 VUs, 1666 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m04.0s), 100/100 VUs, 1666 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m05.0s), 097/100 VUs, 1669 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m06.0s), 097/100 VUs, 1669 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m07.0s), 097/100 VUs, 1669 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m08.0s), 097/100 VUs, 1669 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m09.0s), 097/100 VUs, 1669 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m10.0s), 097/100 VUs, 1669 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m11.0s), 092/100 VUs, 1674 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m12.0s), 092/100 VUs, 1674 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m13.0s), 092/100 VUs, 1674 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m14.0s), 092/100 VUs, 1674 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m15.0s), 092/100 VUs, 1674 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m16.0s), 087/100 VUs, 1679 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m17.0s), 080/100 VUs, 1686 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m18.0s), 064/100 VUs, 1702 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m19.0s), 058/100 VUs, 1708 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m20.0s), 051/100 VUs, 1715 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m21.0s), 037/100 VUs, 1729 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m22.0s), 025/100 VUs, 1741 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m23.0s), 020/100 VUs, 1746 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m24.0s), 016/100 VUs, 1750 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m25.0s), 016/100 VUs, 1750 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m26.0s), 011/100 VUs, 1755 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m27.0s), 006/100 VUs, 1760 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s

running (3m28.0s), 004/100 VUs, 1762 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 100/100 VUs  3m0s  200.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<5000' p(95)=30s

    http_req_failed
    ✓ 'rate<0.99' rate=22.65%

    order_create_error_rate
    ✓ 'rate<0.99' rate=22.65%

    order_create_latency_ms
    ✗ 'p(99)<8000' p(99)=30.01s


  █ TOTAL RESULTS 

    CUSTOM
    order_create_error_rate........: 22.65% 400 out of 1766
    order_create_failure_total.....: 400    1.923037/s
    order_create_latency_ms........: avg=11.27s min=264.43ms med=4.42s max=30.1s  p(90)=30s   p(95)=30s    p(99)=30.01s
    order_create_success_total.....: 1366   6.567171/s

    HTTP
    http_req_duration..............: avg=11.27s min=264.43ms med=4.42s max=30.1s  p(90)=30s   p(95)=30s    p(99)=30.01s
      { expected_response:true }...: avg=5.79s  min=264.43ms med=4.19s max=26.13s p(90)=9.38s p(95)=23.32s p(99)=25.46s
    http_req_failed................: 22.65% 400 out of 1766
    http_reqs......................: 1766   8.490208/s

    EXECUTION
    dropped_iterations.............: 34235  164.587922/s
    iteration_duration.............: avg=11.28s min=326.32ms med=4.42s max=30.16s p(90)=30s   p(95)=30s    p(99)=30.03s
    iterations.....................: 1766   8.490208/s
    vus............................: 4      min=4           max=100
    vus_max........................: 100    min=100         max=100

    NETWORK
    data_received..................: 1.4 MB 6.9 kB/s
    data_sent......................: 929 kB 4.5 kB/s



running (3m28.0s), 000/100 VUs, 1766 complete and 0 interrupted iterations
checkout_prepare_load ✓ [ 100% ] 000/100 VUs  3m0s  200.00 iters/s